{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "How are you?",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hello! I'm TroubleTech, your virtual assistant. How can I help you today with your technical issues?",
        "Good to see you again! I'm here to assist you with any troubleshooting or tech-related concerns you might have.",
        "Hi there! I'm TroubleTech. Let me know if you need help with slow devices, internet issues, software updates, or anything else."
      ]
    },
    {
      "tag": "response_to_hello",
      "patterns": [
        "How are you?",
        "how are you doing?",
        "what's up?",
        "how's it going?"
      ],
      "responses": ["I'm bot. i don't have feelings, but thank you for asking."]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "Goodbye! If you ever need tech support again, don't hesitate to ask. Have a great day!",
        "Take care! I hope I was able to help. Come back anytime if you need assistance.",
        "Bye! Remember, technology can be tricky, but I'm always here to guide you whenever you need help."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "ty", "tnx"],
      "responses": [
        "You're very welcome! I'm always here to assist with any tech problems you have.",
        "Glad I could help! If you ever need more guidance, feel free to ask.",
        "No problem at all! Troubleshooting technology can be frustrating, but I'm here to make it easier for you."
      ]
    },
    {
      "tag": "troubleshoot_slow_computer",
      "patterns": [
        "My computer is slow",
        "Why is my computer running slow?",
        "How can I speed up my computer?"
      ],
      "responses": [
        "A slow computer can be caused by many factors. Try restarting your device, closing unnecessary programs, updating your software, and running a malware scan. If your storage is almost full, consider deleting unused files or moving them to an external drive.",
        "To speed up your computer, ensure that your operating system and drivers are up to date. Also, check your startup programs and disable those you don't need. Adding more RAM or switching to an SSD can significantly boost performance."
      ]
    },
    {
      "tag": "troubleshoot_no_internet",
      "patterns": [
        "I can't connect to the internet",
        "Why is my internet not working?",
        "How do I fix my internet connection?",
        "No Wi-Fi connection",
        "My internet keeps disconnecting",
        "Wi-Fi is connected but no internet",
        "Why is my Wi-Fi so slow?",
        "My internet is not working properly",
        "I have no internet access",
        "Can't browse the web"
      ],
      "responses": [
        "If you're experiencing internet issues, start by restarting your modem and router. Check if other devices are able to connect to the network. If not, contact your Internet Service Provider (ISP) to check for outages. Also, ensure your device's Wi-Fi or mobile data is enabled and try reconnecting. \n Slow or unstable internet can be caused by interference, outdated hardware, or too many connected devices. Try moving closer to the router, switching to a less congested Wi-Fi channel, or using a wired connection for better stability."
      ]
    },
    {
      "tag": "troubleshoot_printer",
      "patterns": [
        "My printer is not working",
        "Why won't my printer print?",
        "How do I fix my printer?"
      ],
      "responses": [
        "First, check if your printer is powered on and properly connected to your computer or network. Ensure there is enough paper, ink, or toner. If the issue persists, try reinstalling the printer drivers or running the troubleshooting tool on your device.",
        "If your printer is not responding, check the print queue for stuck jobs. Restart both the printer and the computer, and make sure you have the correct printer selected. If you're using a wireless printer, verify the connection and reconfigure it if needed."
      ]
    },
    {
      "tag": "troubleshoot_phone_slow",
      "patterns": [
        "My smartphone is running slow.",
        "Why is my smartphone lagging?",
        "Apps keep crashing on my smartphone.",
        "My phone is charging slowly.",
        "My phone takes too much time to charge.",
        "How can I fix slow performance on my phone?"
      ],
      "responses": [
        "** Phone Performance & Charging Troubleshooting Guide** \n\nIf your phone is slow or apps keep crashing, try these steps:\n\n### Improving Phone Speed\n1. **Close Unused Apps** – Running too many background apps can slow down performance.\n2. **Clear Cache Data** – Go to Settings > Storage and clear cache files to free up space.\n3. **Check Storage Space** – Ensure your device has at least 10-20% free storage.\n4. **Restart Your Phone** – A simple reboot can fix minor lag issues.\n5. **Disable Animations** – Reduce UI animations in developer options for a smoother experience.\n6. **Update Your Software** – Outdated OS versions can cause slow performance and app crashes.\n7. **Reset App Preferences** – This restores default settings for apps without deleting data.\n\n### Fixing App Crashes\n- **Update or Reinstall Apps** – Bugs in outdated versions can cause crashes.\n- **Clear App Cache** – Go to Settings > Apps > [App Name] > Storage > Clear Cache.\n- **Check for Software Updates** – Some crashes are fixed in system updates.\n- **Disable Battery Optimization for Apps** – Some apps may be restricted from running properly in the background.\n\n### Solving Slow Charging Issues\n- **Use an Original or Certified Charger** – Low-quality cables or adapters can slow down charging.\n- **Avoid Charging Through a Computer USB Port** – Use a wall adapter for faster charging.\n- **Check Charging Cable & Adapter** : Look for signs of damage or wear.\n- **Enable Airplane Mode While Charging** : This reduces background activity and speeds up charging.\n- **Avoid Using the Phone While Charging** : Running apps while charging can slow down the process.\n- **Clean the Charging Port** : Dust or lint in the charging port may cause slow charging.\n\nIf the problem persists, consider checking your **battery health** or **visiting a repair center** for further diagnosis."
      ]
    },
    {
      "tag": "no_sound",
      "patterns": [
        "There's no sound on my computer.",
        "My phone has no audio.",
        "I can't hear anything from my speakers",
        "I want to fix sound problems on my computer",
        "I'm having trouble with my audio.",
        "The audio on my computer is not working."
      ],
      "responses": [
        "## No Sound Troubleshooting Guide\n\nIf your device has no sound, follow these steps to diagnose and fix the issue:\n\n### Basic Checks\n1. **Check Volume Settings** – Ensure your device is not muted and the volume is turned up.\n2. **Select the Correct Output Device** – Go to your sound settings and verify that the correct speaker or headphone is selected.\n3. **Try a Different Audio Source** – Play a different video, music file, or system sound to confirm the issue isn't with the media itself.\n4. **Restart Your Device** – A simple reboot can fix minor glitches.\n\n### PC/Laptop Troubleshooting\n- **Update Audio Drivers** – Outdated or corrupted drivers can cause sound issues. Update them through **Device Manager** (Windows) or **System Preferences** (Mac).\n- **Run the Audio Troubleshooter** – On Windows, go to **Settings > System > Sound > Troubleshoot**.\n- **Check Sound Settings** – Ensure your device isn’t set to 'Digital Output' or another incorrect source.\n- **Try an External Speaker or Headphones** – This helps determine if the issue is with your speakers or the internal sound system.\n\n### Mobile Device Troubleshooting\n- **Disable Bluetooth** – If sound is being sent to a paired Bluetooth device, disconnect it.\n- **Clear App Cache** – If audio issues occur in a specific app, try clearing its cache.\n- **Check for Do Not Disturb Mode** – Some devices mute sounds when this mode is enabled.\n\n### External Speakers or Headphones\n- Ensure they are properly connected and plugged into the right port.\n- If using Bluetooth, **disconnect and reconnect** the device.\n- **Try another device** – Test the speakers/headphones on a different computer or phone to rule out hardware failure.\n\n### Advanced Fixes\n- **Check for Windows or macOS Updates** – Some updates include important sound fixes.\n- **Uninstall and Reinstall Audio Drivers** – If updates don’t work, try uninstalling and reinstalling the audio driver.\n- **Reset System Sound Settings** – On Windows, you can reset all sound settings to default from the Control Panel.\n\nIf none of these steps work, there may be a **hardware issue** with your device. You may need professional repair or replacement."
      ]
    },
    {
      "tag": "screen_issues",
      "patterns": [
        "flickering",
        "glitching",
        "flicker",
        "My phone screen is frozen.",
        "black screen",
        "Fix display issues",
        "My screen is black even though my device is on"
      ],
      "responses": [
        "Screen flickering or glitches can be caused by outdated display drivers, loose connections, or a failing screen. Try updating your display drivers, adjusting refresh rates, or testing the screen on another monitor.",
        "If your phone screen is frozen, perform a forced restart by holding the power and volume buttons simultaneously for a few seconds. If the issue continues, check for software updates or reset the device to factory settings."
      ]
    },

    {
      "tag": "monitor_not_working",
      "patterns": [
        "My monitor is not working",
        "My screen is not working",
        "Why isn't my monitor turning on?",
        "Why is my monitor black?",
        "I can't see anything on my monitor",
        "My monitor is not displaying anything"
      ],
      "responses": [
        "**If your monitor isn't working, try the following steps:**\n\n1. **Check the Power**: Ensure the monitor is plugged into a power source and the power button is on. If it's a laptop, check if it's charging.\n\n2. **Check the Cable Connections**: Make sure the video cable (HDMI, VGA, DisplayPort, etc.) is securely connected between the monitor and your computer. If the cable is damaged, try replacing it.\n\n3. **Test with Another Device**: Connect the monitor to another computer or device to rule out issues with the monitor itself.\n\n4. **Adjust Brightness and Contrast**: It's possible that the monitor's brightness or contrast settings are too low, making it appear as if it's not working.\n\n5. **Check the Graphics Card**: If you're using a dedicated graphics card, make sure it's properly seated in its slot. Also, check if the correct input source is selected on the monitor (e.g., HDMI 1, VGA).\n\n6. **Restart Your Computer**: Sometimes a simple restart can resolve display issues, especially if it's related to a software glitch.\n\n7. **Test with Another Monitor**: If you have access to another monitor, try using it with your computer. If the second monitor works, the issue is likely with your original monitor.\n\n8. **Update or Reinstall Drivers**: Outdated or corrupted graphics drivers can cause display issues. Ensure your drivers are up to date, or try reinstalling them.\n\n9. **Check for Hardware Issues**: If none of the above solutions work, there may be a hardware issue with your monitor or your computer's graphics card. Consider reaching out to a technician for further assistance."
      ]
    },

    {
      "tag": "device_full_storage",
      "patterns": [
        "full storage",
        "full storage device",
        "full storage HDD",
        "My device says it's out of storage even after deleting files",
        "I want to know how to free up space on my phone",
        "I want to know how to free up space on my computer",
        "My device is full, how do I make more space?",
        "How can I free up storage on my phone?",
        "What should I do when my computer is running out of storage?"
      ],
      "responses": [
        "To free up storage, delete unnecessary files, clear temporary data, and remove unused applications. Consider moving large files to an external drive or cloud storage to create more space.",
        "Check if there are duplicate files, old downloads, or unused apps taking up space. Using storage management tools on your device can help identify what's consuming the most storage and suggest ways to clear it."
      ]
    },
    {
      "tag": "software_update",
      "patterns": [
        "I want to know how to update my computer",
        "How do I update my phone software?"
      ],
      "responses": [
        "To update your system, go to settings and check for software updates. Make sure you have enough storage and battery before starting the update. A stable internet connection is also necessary to avoid interruptions."
      ]
    },
    {
      "tag": "error_update",
      "patterns": [
        "I'm getting an error when updating my software",
        "My phone won't update.",
        "My software update is failing",
        "I can't install the latest update",
        "The update is stuck at a certain percentage",
        "My system update is not working"
      ],
      "responses": [
        "**If you're experiencing issues updating your software, follow these steps:**\n\n1. **Check Storage Space**: Ensure your device has enough free storage. System updates require additional space to download and install, so try deleting unused apps or clearing cache files before retrying the update.\n\n2. **Stable Internet Connection**: A stable internet connection is crucial for software updates. If your update is failing, switch to a stronger Wi-Fi connection and avoid using mobile data. Restart your router and reconnect your device to the network if the download is stuck.\n\n3. **Battery Level**: Low battery can prevent updates from installing properly. Ensure your device has at least 50% battery, or keep it plugged in during the update process. Some updates will not proceed unless your device is connected to a charger.\n\n4. **Update Stuck at a Certain Percentage**: If the update gets stuck, restart your device and try checking for updates again.\n\n5. **Clear System Update Cache**: For Android devices, clearing the system update cache may help resolve the issue. For computers, using a wired connection can sometimes resolve issues.\n\n6. **Error Messages**: If you're receiving an error message during the update, take note of the error code and search for troubleshooting steps specific to that code.\n\n7. **Server Overload**: Some errors may indicate server overload. In this case, you may need to wait and try again later.\n\n8. **Manual Download**: If the update keeps failing, consider downloading it manually from the official website or use a PC-based update tool like iTunes (for iPhones) or Samsung Smart Switch (for Samsung devices).\n\n9. **Factory Reset**: In extreme cases, a factory reset may be required if the update process is corrupted. Ensure that you back up all important data before proceeding with this.\n\n10. **Contact Support**: If the issue persists, contact the device manufacturer or visit an authorized service center for further assistance."
      ]
    }
  ]
}
